app/controllers/comment_controller.rb

SELECT * FROM "posts" WHERE ("posts"."slug" = 'temporary_post_used_for_theme_detection_1b366a493bc44dc29da306dbebf4efac_3bfe001a32de4114a6b44005b770f6d7') LIMIT 1
---
  def new
    @post = Post.find_by_slug(params[:slug])

SELECT * FROM "comments" WHERE ("comments"."id" = 32) ORDER BY created_at DESC
---
  def reply
    @comment = Comment.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 10)
INSERT INTO "comments" ("user", "updated_at", "text", "post_id", "website", "reply_to", "created_at") VALUES('Nom', '2010-10-26 23:57:34', 'Commentaire', NULL, NULL, NULL, '2010-10-26 23:57:34')
UPDATE "comments" SET "updated_at" = '2010-10-26 23:57:34', "post_id" = 10 WHERE "id" = 19
---
  def add_comment
    post = Post.find(params[:id])
    comment = Comment.create!(:user => params[:name], :text => params[:comment])

    post.comments << comment
    post.save

SELECT * FROM "comments" WHERE ("comments"."id" = 32) ORDER BY created_at DESC
INSERT INTO "comments" ("user", "updated_at", "text", "post_id", "website", "reply_to", "created_at") VALUES('Jeremy', '2010-10-27 01:30:28', 'wassup', NULL, NULL, 17, '2010-10-27 01:30:28')
UPDATE "comments" SET "updated_at" = '2010-10-27 01:30:28', "post_id" = 10 WHERE "id" = 31
---
  def add_reply
    root_comment = Comment.find(params[:id]);
    reply = Comment.create!(:user => params[:name], :text => params[:comment], :reply_to => root_comment.id)
    post = root_comment.post
    post.comments << reply
    post.save