app/controllers/post_controller.rb

  def show
    @post= Post.find_by_slug(params[:slug])
---
SELECT * FROM "posts" WHERE ("posts"."slug" = 'contact') LIMIT 1

  def add_comment
    post = Post.find(params[:id]);
    comment = Comment.create!(:user => params[:name], :text => params[:comment])

    post.comments << comment
    post.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("user", "updated_at", "text", "post_id", "website", "reply_to", "created_at") VALUES('Jim', '2010-10-19 00:14:03', 'TESY', NULL, NULL, NULL, '2010-10-19 00:14:03')
UPDATE "comments" SET "updated_at" = '2010-10-14 23:35:42', "post_id" = 1 WHERE "id" = 1