app/controllers/videos_controller.rb

SELECT * FROM "videos"
---
  def index
    @videos = Video.all

SELECT * FROM "videos" ORDER BY created_at DESC
---
  def list
    @videos = Video.all(:order => 'created_at DESC')

SELECT * FROM "videos" WHERE ("videos"."id" = 1)
---
  def show
    @video = Video.find(params[:id])

SELECT * FROM "videos" WHERE ("videos"."id" = 1)
---
  def edit
    @video = Video.find(params[:id])

INSERT INTO "videos" ("name", "updated_at", "description", "embed", "created_at") VALUES('david lemieux vs elivin alaya', '2010-10-18 02:41:32', 'wazza', '<object width="640" height="385"><param name="movie" value="http://www.youtube.com/v/ByntNl4vaz8?fs=1&amp;hl=en_US"></param><param name="allowFullScreen" value="true"></param><param name="allowscriptaccess" value="always"></param><embed src="http://www.youtube.com/v/ByntNl4vaz8?fs=1&amp;hl=en_US" type="application/x-shockwave-flash" allowscriptaccess="always" allowfullscreen="true" width="640" height="385"></embed></object>', '2010-10-18 02:41:32')
---
  def create
    @video = Video.new(params[:video])

    respond_to do |format|
      if @video.save

SELECT * FROM "videos" WHERE ("videos"."id" = 1)
UPDATE "videos" SET "embed" = '<object width="480" height="385"><param name="movie" value="http://www.youtube.com/v/tLM7KM57uEs?fs=1&amp;hl=en_US"></param><param name="allowFullScreen" value="true"></param><param name="allowscriptaccess" value="always"></param><embed src="http://www.youtube.com/v/tLM7KM57uEs?fs=1&amp;hl=en_US" type="application/x-shockwave-flash" allowscriptaccess="always" allowfullscreen="true" width="480" height="385"></embed></object>', "updated_at" = '2010-10-18 00:54:58' WHERE "id" = 1
---
  def update
    @video = Video.find(params[:id])

    respond_to do |format|
      if @video.update_attributes(params[:video])